<?php
/**
 * Created by PhpStorm.
 * User: ns
 * Date: 12.11.18
 * Time: 18.31
 */

$data = [
    'table' => [
        [
            'date' => '3 сентября 2018',
            'time' => '16:23',
            'address' => 'г.Минск, ул. Дунина-Мартинкевича, 11',
            'check' => '8.2318.354',
            'sum' => 25.02,
            'add' => 0.25,
            'remove' => 0.02
        ],
        [
            'date' => '3 сентября 2018',
            'time' => '16:23',
            'address' => 'г.Минск, ул. Дунина-Мартинкевича, 11',
            'check' => '8.2318.354',
            'sum' => 25.02,
            'add' => 0.25,
            'remove' => 0.02
        ],
        [
            'date' => '3 сентября 2018',
            'time' => '16:23',
            'address' => 'г.Минск, ул. Дунина-Мартинкевича, 11',
            'check' => '8.2318.354',
            'sum' => 25.02,
            'add' => 0.25,
            'remove' => 0.02
        ],
        [
            'date' => '3 сентября 2018',
            'time' => '16:23',
            'address' => 'г.Минск, ул. Дунина-Мартинкевича, 11',
            'check' => '8.2318.354',
            'sum' => 25.02,
            'add' => 0.25,
            'remove' => 0.02
        ],
        [
            'date' => '3 сентября 2018',
            'time' => '16:23',
            'address' => 'г.Минск, ул. Дунина-Мартинкевича, 11',
            'check' => '8.2318.354',
            'sum' => 25.02,
            'add' => 0.25,
            'remove' => 0.02
        ],
        [
            'date' => '3 сентября 2018',
            'time' => '16:23',
            'address' => 'г.Минск, ул. Дунина-Мартинкевича, 11',
            'check' => '8.2318.354',
            'sum' => 25.02,
            'add' => 0.25,
            'remove' => 0.02
        ],
        [
            'date' => '3 сентября 2018',
            'time' => '16:23',
            'address' => 'г.Минск, ул. Дунина-Мартинкевича, 11',
            'check' => '8.2318.354',
            'sum' => 25.02,
            'add' => 0.25,
            'remove' => 0.02
        ]
    ],
    'chart' => [
        [
            'color' => '#7138FF',
            'title' => 'Молочные продукты',
            'value' => 21.14,
            'count' => 15,
            'sum' => 45.72
        ],
        [
            'color' => '#00A4EE',
            'title' => 'Замороженные продукты, мороженное',
            'value' => 20.79,
            'count' => 152,
            'sum' => 43.18
        ],
        [
            'color' => '#FFCE4A',
            'title' => 'Мясо, птица, яйцо',
            'value' => 19.04,
            'count' => 135,
            'sum' => 410.02
        ],
        [
            'color' => '#00C1C1',
            'title' => 'Овощи, фрукты, грибы',
            'value' => 14,
            'count' => 155,
            'sum' => 38.67
        ],
        [
            'color' => '#FF6488',
            'title' => 'Хлебобулочные изделия',
            'value' => 11.1,
            'count' => 15,
            'sum' => 33.40
        ],
        [
            'color' => '#FFA137',
            'title' => 'Товары для детей',
            'value' => 10.21,
            'count' => 165,
            'sum' => 31.07
        ],
        [
            'color' => '#1B6FEA',
            'title' => 'Прочее',
            'value' => 3.32,
            'count' => 15,
            'sum' => 9.98

        ]
    ]
];


echo json_encode($data, true);
